app/DatabaseStorage.php

update `cart_storage` set `cart_data` = 'a:0:{}', `cart_storage`.`updated_at` = '2020-10-21 19:52:40' where `id` = '51_cart_items'
---
    public function put($key, $value)
    {
        if($row = DatabaseStorageModel::find($key))
        {
            // update
            $row->cart_data = $value;
            $row->save();