app/Http/Controllers/OrderController.php

select * from `orders` where `user_id` = 51
---
    public function show(): View
    {
        $orders = Order::where('user_id', Auth::id())->get();