app/Http/Controllers/PaymentController.php

    public function store(PlacetoPay $placetopay, PaymentInfoRequest $request): RedirectResponse
    {
        $orderData = array_merge($request->all(), [
            'reference' => substr(Str::uuid()->toString(), 0, 10),
            'user_id' => Auth::id(),
            'total' => $this->cartService->getACartFromUser()->getTotal()
        ]);

        $order = Order::create($orderData);

        foreach ($this->cartService->getAContentCartFromAUser() as $product) {
            $order->products()->attach($product['id']);
        }

        try {
            $payment = new PaymentData($order);

            $response = $placetopay->request($payment->setPayment());

            if ($response->isSuccessful()) {
                $response->processUrl();

                $order->requestId = $response->requestId;
                $order->processUrl = $response->processUrl;
                $order->status = $response->status()->status();
                $order->save();
---
update `orders` set `reference` = '15ad99f8-b', `user_id` = 51, `total` = 2211, `requestId` = 419074, `processUrl` = 'https://test.placetopay.com/redirection/session/419074/0efef1ed513191e9984e722ca8eb291d', `status` = 'OK', `orders`.`updated_at` = '2020-10-21 19:52:23' where `id` = 9