app/Http/Controllers/StoreController.php

    public function showProducts(Request $request)
    {
        $products = Product::with('category')->ProductInfo($request->input('search'))->paginate();

        return view('store.productShow', compact('products'));

       /*$key = "product.page". request('page', 1);

       $products = Cache::rememberForever($key, function ()
        use ($request){
            return Product::with('category')->ProductInfo($request->input('search'))->paginate(15);
---
select * from `products` order by RAND() limit 3 offset 0
select count(*) as aggregate from `products`
select * from `categories` where `categories`.`id` in (2, 4, 7, 8, 9, 10, 12, 13, 14, 18)
select * from `products` limit 15 offset 0