app/Http/Controllers/Admin/ProductController.php

    public function index(IndexProductRequest $request)
    {
        $products = Product::ProductInfo($request->input('search'))->paginate();
---
select * from `products` limit 15 offset 0
select count(*) as aggregate from `products`

    public function destroy(Product $product) : RedirectResponse
    {
        Storage::delete($product->file);
        $product->delete();
---
delete from `products` where `id` = 1