app/Http/Controllers/Admin/UserController.php

select * from `users` limit 15 offset 0
select count(*) as aggregate from `users`
---
    public function index(Request $request): View
    {
        $users = User::UserInfo($request->input('search'))->paginate();